{"config": [{"config": {"mode_type": "raw", "output_mask_type": "raw", "arguments": {}, "output_shape": null, "concat_axis": 1, "name": "merge_1", "output_shape_type": "raw", "output_mask": null, "dot_axes": -1, "layers": [{"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_1", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 78477, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_2", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 64, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_3", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 91, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_4", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 14, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_5", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 42, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_6", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_7", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_8", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_9", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 9, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_10", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 22, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_11", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_12", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 6, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_13", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_14", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 78477, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_15", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 64, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_16", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 91, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_17", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 14, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_18", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 42, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_19", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_20", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_21", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_22", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 9, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_23", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 22, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_24", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_25", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 6, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_26", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_27", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 78477, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_28", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 64, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_29", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 91, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_30", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 14, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_31", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 42, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_32", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_33", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_34", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_35", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 9, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_36", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 22, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_37", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_38", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 6, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_39", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_40", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 78477, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_41", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 64, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_42", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 91, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_43", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 14, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_44", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 42, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_45", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_46", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_47", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_48", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 9, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_49", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 22, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_50", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_51", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 6, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_52", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_53", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 78477, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_54", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 64, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_55", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 91, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_56", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 14, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_57", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 42, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_58", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_59", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_60", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_61", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 9, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_62", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 22, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_63", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_64", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 6, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "output_dim": 3, "input_length": 1, "name": "embedding_65", "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 1], "input_dim": 2, "embeddings_constraint": null}, "class_name": "Embedding"}], "class_name": "Sequential"}], "mode": "concat"}, "class_name": "Merge"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "strides": [1], "name": "conv1d_1", "trainable": true, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "kernel_size": [3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "strides": [1], "name": "conv1d_2", "trainable": true, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "kernel_size": [3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "strides": [1], "name": "conv1d_3", "trainable": true, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "kernel_size": [3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "strides": [1], "name": "conv1d_4", "trainable": true, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "kernel_size": [3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "strides": [1], "name": "conv1d_5", "trainable": true, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "filters": 64, "kernel_size": [3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "units": 32, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 2, "name": "dense_2", "trainable": true, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}