{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Merge",
      "config": {
        "name": "merge_1",
        "mode": "concat",
        "mode_type": "raw",
        "concat_axis": 1,
        "dot_axes": -1,
        "output_shape": null,
        "output_shape_type": "raw",
        "output_mask": null,
        "output_mask_type": "raw",
        "arguments": {},
        "layers": [
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_1",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 78475,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_2",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 64,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_3",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 91,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_4",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 14,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_5",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 42,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_6",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_7",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_8",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_9",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 9,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_10",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 22,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_11",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_12",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 6,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_13",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_14",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 78475,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_15",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 64,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_16",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 91,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_17",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 14,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_18",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 42,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_19",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_20",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_21",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_22",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 9,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_23",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 22,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_24",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_25",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 6,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_26",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_27",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 78475,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_28",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 64,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_29",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 91,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_30",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 14,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_31",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 42,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_32",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_33",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_34",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_35",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 9,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_36",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 22,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_37",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_38",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 6,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_39",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_40",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 78475,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_41",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 64,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_42",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 91,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_43",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 14,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_44",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 42,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_45",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_46",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_47",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 2,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_48",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
                  "dtype": "float32",
                  "input_dim": 9,
                  "output_dim": 3,
                  "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                      "minval": -0.05,
                      "maxval": 0.05,
                      "seed": null
                    }
                  },
                  "embeddings_regularizer": null,
                  "activity_regularizer": null,
                  "embeddings_constraint": null,
                  "mask_zero": false,
                  "input_length": 1
                }
              }
            ]
          },
          {
            "class_name": "Sequential",
            "config": [
              {
                "class_name": "Embedding",
                "config": {
                  "name": "embedding_49",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    1
                  ],
